icc_shell> gui_start
Information: Visibility is turned ON for cells and cell contents because the task is set to Block Implementation (GUI-026)
icc_shell> pwd
/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build
icc_shell> cd flo-vlsi/
icc_shell> l
Error: ambiguous command 'l' matched 20 commands:
        (legalize_fp_placement, legalize_placement, legalize_rp_placement ...) (CMD-006)
icc_shell> cd vlsi/
icc_shell> ld
Error: unknown command 'ld' (CMD-005)
icc_shell> cd build/
icc_shell> ls
.             README           dc-syn.top       icc-dp          setup
..            README-MIM       dc-syn.top.hier  icc-par         vcs-sim-gl-par
.gitignore    command.log      dc-syn.top.phy   icc-par.tile    vcs-sim-gl-syn
Makefile      dc-syn           filenames.log    icc-par.top     vcs-sim-rtl
Makefrag      dc-syn.tile      generated-rams   icc_output.txt
Makefrag-sim  dc-syn.tile.phy  generated-src    pt-pwr
icc_shell> cd icc-par.top/
icc_shell> ls
.           Makefile                    command.log    floorplan       setup
..          Makefrag                    current-icc    icc_output.txt
.gitignore  build-icc-2016-04-28_03-21  filenames.log  icc_scripts
icc_shell> cd current-icc/
icc_shell> source icc_setup.tcl
Warning: Top library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/TestBlockModule_LIB' in reference library control file is inconsistent with current library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB'. (MW-212)

------------------- Internal Reference Library Settings -----------------

Library    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/GarpAccel_LIB
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_hvt/milkyway/saed32nm_hvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_rvt/milkyway/saed32nm_rvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_lvt/milkyway/saed32nm_lvt_1p9m
  Reference    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.mw
  Reference    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB

Library    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_hvt/milkyway/saed32nm_hvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_rvt/milkyway/saed32nm_rvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_lvt/milkyway/saed32nm_lvt_1p9m
  Reference    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.mw


------------------- Control File Reference Library Settings -----------
Warning: Top library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/TestBlockModule_LIB' in reference library control file is inconsistent with current library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB'. (MW-212)

Library    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/GarpAccel_LIB
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_hvt/milkyway/saed32nm_hvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_rvt/milkyway/saed32nm_rvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_lvt/milkyway/saed32nm_lvt_1p9m
  Reference    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.mw
  Reference    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB

Library    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_hvt/milkyway/saed32nm_hvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_rvt/milkyway/saed32nm_rvt_1p9m
  Reference    /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_lvt/milkyway/saed32nm_lvt_1p9m
  Reference    /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.mw
-------------------------------------------------------------------------

icc_shell> 
Warning: Top library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/TestBlockModule_LIB' in reference library control file is inconsistent with current library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB'. (MW-212)
Warning: Top library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/TestBlockModule_LIB' in reference library control file is inconsistent with current library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB'. (MW-212)
Warning: Top library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/TestBlockModule_LIB' in reference library control file is inconsistent with current library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB'. (MW-212)
icc_shell> open_mw_lib  -readonly /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/current-icc/GarpAccel_LIB
Warning: Top library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/TestBlockModule_LIB' in reference library control file is inconsistent with current library path '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB'. (MW-212)
{GarpAccel_LIB}
icc_shell> open_mw_cel -readonly change_names_icc
Preparing data for query................... 
Warning: Conflict unit found: MW tech file resistance unit is kOhm; Main Library resistance unit is MOhm. (IFS-007)
Information: Pushing cache limit of [1024Mb] for axh
Information: Opened "change_names_icc.CEL;1" from "/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.top/build-icc-2016-04-28_03-21/GarpAccel_LIB" library. (MWUI-068)
icc_shell> open_mw_cel -readonly change_names_icc
Error: Design 'change_names_icc.CEL;0' is an open design. (MWUI-010)
icc_shell> ls
.                                     find_regs.tcl
..                                    floorplan.tcl
GarpAccel_LIB                         force_regs.ucli
GarpAccel_port_map.0                  icc
Makefrag                              icc_output.txt
access.tab                            icc_setup.tcl
check_icc_rm_values.tcl               init_design_icc
chip_finish_icc                       init_design_icc.tcl
chip_finish_icc.tcl                   log
clock_opt_cts_icc                     make_generated_vars.tcl
clock_opt_cts_icc.tcl                 outputs_icc
clock_opt_psyn_icc                    outputs_icc.tcl
clock_opt_psyn_icc.tcl                place_opt_icc
clock_opt_route_icc                   place_opt_icc.tcl
clock_opt_route_icc.tcl               reports
command.log                           results
common_cts_settings_icc.tcl           route_icc
common_optimization_settings_icc.tcl  route_icc.tcl
common_placement_settings_icc.tcl     route_opt_icc
common_post_cts_timing_settings.tcl   route_opt_icc.tcl
common_route_si_settings_zrt_icc.tcl  timestamp
common_setup.tcl                      timestamp-dc
dont_use_cells.tcl
icc_shell> set_disable_timing  [get_pins {*}]
Reading reference libraries ...
Loading db file '/home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_hvt.db'
Loading db file '/home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_rvt.db'
Loading db file '/home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_lvt.db'
Loading db file '/home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.db'
Loading db file '/share/instsww/synopsys_cs250/icc/current/libraries/syn/gtech.db'
Information: linking reference library : /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_hvt/milkyway/saed32nm_hvt_1p9m. (PSYN-878)
Information: linking reference library : /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_rvt/milkyway/saed32nm_rvt_1p9m. (PSYN-878)
Information: linking reference library : /home/ff/cs250/fa10/stdcells/synopsys-32nm/vendor/lib/stdcell_lvt/milkyway/saed32nm_lvt_1p9m. (PSYN-878)
Information: linking reference library : /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.mw. (PSYN-878)
Information: linking reference library : /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/icc-par.tile/build-icc-2016-04-28_03-12/TestBlockModule_LIB. (PSYN-878)
Information: Loading local_link_library attribute {/home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_hvt.db, /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_rvt.db, /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_lvt.db, /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.db}. (MWDC-290)

  Linking design 'GarpAccel'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (2 designs)               change_names_icc.CEL, etc
  saed32hvt_tt1p05v25c (library) /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_hvt.db
  saed32rvt_tt1p05v25c (library) /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_rvt.db
  saed32lvt_tt1p05v25c (library) /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/db/cells_lvt.db
  sram8t17x64 (library)       /home/cc/cs250/sp16/class/cs250-ai/garp/lab3/build/flo-vlsi/vlsi/build/generated-rams/sram8t17x64.db

Load global CTS reference options from NID to stack
1
icc_shell> report_timing
Information: The design has horizontal rows, and Y-symmetry has been used for sites. (MWDC-217)
Floorplan loading succeeded.

  Loading design 'GarpAccel'




Information: Library Manufacturing Grid(GridResolution) : 1
Information: Time Unit from Milkyway design library: 'ns' 
Information: Design Library and main library timing units are matched - 1.000 ns. 
Information: Resistance Unit from Milkyway design library: 'kohm' 
Warning: Mismatch in the main library and the Milkyway library resistance units. In the main library it is 1000.000 kohm and in the Milkyway design library it is 1.000 kohm. Check and correct the resistance units in the .tf and .db files. (PSYN-476)
Information: Capacitance Unit from Milkyway design library: 'ff' 
Information: Design Library and main library capacitance units are matched - 0.001 pf. 
Warning: Inconsistent library data found for layer PO. (RCEX-018)
Information: Layer M1 is ignored for resistance and capacitance computation. (RCEX-019)
Information: Layer MRDL is ignored for resistance and capacitance computation. (RCEX-019)

TLU+ File = /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/tluplus/max.tluplus
TLU+ File = /home/ff/cs250/stdcells/synopsys-32nm/multi_vt/tluplus/min.tluplus

--------- Sanity Check on TLUPlus Files -------------
1. Checking the conducting layer names in ITF and mapping file ... 
[ Passed! ]
2. Checking the via layer names in ITF and mapping file ... 
[ Passed! ]
3. Checking the consistency of Min Width and Min Spacing between MW-tech and ITF ... 
[ Passed! ]
----------------- Check Ends ------------------
Information: The distance unit in Capacitance and Resistance is 1 micron. (RCEX-007)
Information: The RC model used is detail route TLU+. (RCEX-015)
Information: Start mixed mode parasitic extraction. (RCEX-023)
Information: Start rc extraction...
Information: Parasitic source is LPE. (RCEX-040)
Information: Parasitic mode is RealRC. (RCEX-041)
Information: Using virtual shield extraction. (RCEX-081)
Information: Extraction mode is MIN_MAX. (RCEX-042)
Information: Extraction derate is 25/25/25. (RCEX-043)
Information: Coupling capacitances are explicitly created. (RCEX-044)
Information: Start back annotation for parasitic extraction. (RCEX-023)
Information: End back annotation for parasitic extraction. (RCEX-023)
Information: Start timing update for parasitic extraction. (RCEX-023)
Information: End timing update for parasitic extraction. (RCEX-023)
Information: End parasitic extraction. (RCEX-023)
Information: Converting capacitance units for library 'sram8t17x64' since those in library 'saed32hvt_tt1p05v25c' differ. (TIM-106)
Warning: The trip points for the library named sram8t17x64 differ from those in the library named saed32hvt_tt1p05v25c. (TIM-164)
Information: Updating graph... (UID-83)

************************************************************
SI options:
Delta Delay Computation:           true
Static Noise Computation:          false
Timing window analysis for SI:     false
Reselection in timing window:      false
Min Delta Delay for SI:            true
Analysis Effort:                   medium
Max Transition Mode:               normal_slew
Static Noise Thresholds:           0.35 (0.37V) above low
                                   0.35 (0.37V) below high
Route xtalk prevention:            true
Route xtalk prevention threshold:  0.25
************************************************************

Information: Updating design information... (UID-85)

************************************************************
SI options:
Delta Delay Computation:           true
Static Noise Computation:          false
Timing window analysis for SI:     false
Reselection in timing window:      false
Min Delta Delay for SI:            true
Analysis Effort:                   medium
Max Transition Mode:               normal_slew
Static Noise Thresholds:           0.35 (0.37V) above low
                                   0.35 (0.37V) below high
Route xtalk prevention:            true
Route xtalk prevention threshold:  0.25
************************************************************

 
****************************************
Report : timing
        -path full
        -delay max
        -max_paths 1
Design : GarpAccel
Version: G-2012.06-ICC-SP3
Date   : Fri Apr 29 10:44:05 2016
****************************************

 * Some/all delay information is back-annotated.

Operating Conditions: tt1p05v25c   Library: saed32hvt_tt1p05v25c

Information: Percent of Arnoldi-based delays =  0.00%

  Startpoint: icc_place15/Y (internal pin)
  Endpoint: io_out_2[0]
            (output port)
  Path Group: (none)
  Path Type: max

  Point                                    Incr       Path
  -----------------------------------------------------------
  icc_place15/Y (NBUFFX2_HVT)              0.00       0.00 r
  io_out_2[0] (out)                        0.00 &     0.00 r
  data arrival time                                   0.00
  -----------------------------------------------------------
  (Path is unconstrained)


1
icc_shell> 